In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.read_csv('../input/some.csv')
print(df)

             Name Hire Date   Salary  Sick Days remaining
0  Graham Chapman  03/15/14  50000.0                   10
1     John Cleese  06/01/15  65000.0                    8
2       Eric Idle  05/12/14  45000.0                   10
3     Terry Jones  11/01/13  70000.0                    3
4   Terry Gilliam  08/12/14  48000.0                    7
5   Michael Palin  05/23/13  66000.0                    8

In [3]:
print(type(df['Hire Date'][0]))

<class 'str'>

In [4]:
df.to_csv('../input/someWrite.csv')

In [5]:
df2 = pd.read_csv('../input/someWrite.csv')

In [6]:
df2

   Unnamed: 0            Name Hire Date   Salary  Sick Days remaining
0           0  Graham Chapman  03/15/14  50000.0                   10
1           1     John Cleese  06/01/15  65000.0                    8
2           2       Eric Idle  05/12/14  45000.0                   10
3           3     Terry Jones  11/01/13  70000.0                    3
4           4   Terry Gilliam  08/12/14  48000.0                    7
5           5   Michael Palin  05/23/13  66000.0                    8

In [8]:
df3 = pd.read_csv('../input/someWrite.csv',index_col=[0])

In [9]:
df3

             Name Hire Date   Salary  Sick Days remaining
0  Graham Chapman  03/15/14  50000.0                   10
1     John Cleese  06/01/15  65000.0                    8
2       Eric Idle  05/12/14  45000.0                   10
3     Terry Jones  11/01/13  70000.0                    3
4   Terry Gilliam  08/12/14  48000.0                    7
5   Michael Palin  05/23/13  66000.0                    8

In [11]:
from pandas import DataFrame
C = {'Programming language': ['Python','Java', 'C++'],
        'Designed by': ['Guido van Rossum', 'James Gosling', 'Bjarne Stroustrup'],
        'Appeared': ['1991', '1995', '1985'],
        'Extension': ['.py', '.java', '.cpp'],
    }
df4 = DataFrame(C, columns= ['Programming language', 'Designed by', 'Appeared', 'Extension'])

# here you have to write path, where result file will be stored
export_csv = df4.to_csv ('../input/pandaresult.csv', index = None, header=True) 
print (df4)

  Programming language        Designed by Appeared Extension
0               Python   Guido van Rossum     1991       .py
1                 Java      James Gosling     1995     .java
2                  C++  Bjarne Stroustrup     1985      .cpp